{"data":{"markdownRemark":{"html":"<h1 style=\"color: #2B2B2B;\">Ingredients</h1>\n<!-- <h3>Costco</h3> -->\n<ul style=\"font-size: 20px;\">\n    <li>St. Louis Cut Pork Spare Ribs (pack of 3 racks)</li>\n    <li>Simply Supreme Honey Mustard<br>(or a Jalapeño Honey Mustard)</li>\n    <li>Private Selection Kansas City Seasoning Rub - Sweet and Smoky<br>(You can use any rub/seasoning you like)</li>\n    <li>Stubb's Sweet Heat Legendary Bar-B-Q Sauce</li>\n</ul>\n<h1 style=\"color: #2B2B2B; margin-top: 40px;\">Cooking Instructions</h1>\n<ol style=\"font-size: 20px\" className=\"cookingInstructionsOL\">\n    <li style=\"margin: 5px 0;\">Heat grill to 250°F using one end burner, or one side of charcoal. The ribs will be cooked using indirect heat.</li>\n    <li style=\"margin: 5px 0;\">(Optional) Fill a metal pan 3/4 with water and place on the grill above the lit burner or lit coals. While grilling, the water will steam, providing consistent temperatures and increased air moisture.</li>\n    <li style=\"margin: 5px 0;\">Remove ribs from their packaging, and pat down with a paper towel to dry.</li>\n    <li style=\"margin: 5px 0;\">Using a knife and paper towel, remove the fat membrane from the bone side of the ribs. Trim other loose parts of meat or fat from the rack.</li>\n    <li style=\"margin: 5px 0;\">Pour honey mustard on the bone side of the rack, and spread around with your hands making sure the entire side is evenly coated. Don't use too much mustard - just enough to make sure the seasoning will stick.</li>\n    <li style=\"margin: 5px 0;\">Apply the rub of your choice to the honey mustard-covered side of the ribs. Again you don't want to use too much - just enough to evenly coat the side. Lightly press the seasoning onto the ribs.</li>\n    <li style=\"margin: 5px 0;\">Let sit for 5-10 minutes. When the rub seasoning starts to look wet, you can flip the ribs and repeat the honey mustard and rub seasoning process for the other side.</li>\n    <li style=\"margin: 5px 0;\">Place the rack bone-side down on the grill, as far away as possible from the lit burner/coals. We will be performing a \"low and slow\" cook of the ribs - low heat and cooking slowly for a long period of time.</li>\n    <li style=\"margin: 5px 0;\">Let cook for an hour and a half.</li>\n    <li style=\"margin: 5px 0;\">Rotate your rack(s). If cooking more than one, switch racks that are closest to the burner with racks further away, and vice-versa.</li>\n    <li style=\"margin: 5px 0;\">Let cook for an hour.</li>\n    <li style=\"margin: 5px 0;\">Rotate ribs again. Flip rack(s) so the bone-side is up. Be sure to check the water levels in your water pan if you used one.</li>\n    <li style=\"margin: 5px 0;\">Let cook for an hour.</li>\n    <li style=\"margin: 5px 0;\">Flip rack(s) back to bone-side down.</li>\n    <li style=\"margin: 5px 0;\">Let cook for 45 minutes.</li>\n    <li style=\"margin: 5px 0;\">Apply BBQ sauce to both sides of the rack(s). Turn all burners up to high, or move ribs to charcoal side of grill. Flip rack(s) every 2-3 minutes until outside is crispy.</li>\n    <li style=\"margin: 5px 0;\">Pull ribs off grill, and let sit for 10 minutes. Cut ribs, and serve.</li>\n</ol>","frontmatter":{"title":"BBQ Ribs","description":"This post is related to the gatsbyjs","rating":5,"recipeIntroParagraph":"This is the best meal I've made this year so far, and it isn't close! These ribs turned out so much better than I thought they would. I didn't follow a direct recipe, but rather followed instructions on how to cook ribs from a YouTube video, and then used my own honey mustard and rib rub. In the video (linked below), jalapeño honey mustard was used before the rub. If I make these ribs again, I would want to try that out. I used normal honey mustard which provided fantastic sweet flavor, but I am curious if the jalapeño would add a substantial kick. I put these ribs on the grill for about 4-4.5 hours, but the meat was only 'fall off the bone' tender on a few of the ribs. I think if I left it on the grill longer, I could have gotten even better results. In the linked video below, the ribs were in a smoker for about 7 hours. I used a gas grill, so the results could also be dependent on the type of grill used. I don't have a smoker, but would like to try one eventually.","sourceLink":"https://www.youtube.com/watch?v=jlx32wWA68U&t=236s","sourceWebsite":"YouTube","image":null}}},"pageContext":{"slug":"/bbq-chicken-pizza/"}}