{"data":{"markdownRemark":{"html":"<h1 style=\"color: #2B2B2B;\">Ingredients</h1>\n<h3>Safeway</h3>\n<ul style=\"font-size: 20px;\">\n    <li>4 large baking potatoes, cut into French fry strips</li>\n    <li>Frozen peas</li>\n    <li>One 12-ounce bottle of light beer</li>\n    <li>1 & 1/2 pounds cod fillets, skinned with bones removed</li>\n    <li>2 cups all-purpose flour</li>\n    <li>1 bottle of vegetable oil (enough for frying)</li>\n    <li>2 teaspoons salt</li>\n    <li>1/2 teaspoon black pepper</li>\n    <li>1/2 teaspoon garlic powder</li>\n</ul>\n<h1 style=\"color: #2B2B2B; margin-top: 40px;\">Cooking Instructions</h1>\n<h4>(Fry fish while chips are cooling in freezer)</h4>\n<h2>Fish</h2>\n<ol style=\"font-size: 20px\" className=\"cookingInstructionsOL\">\n    <li style=\"margin: 5px 0;\">Heat oil to 375째F in a Dutch oven or deep pot. Heat oven to 250째F.</li>\n    <li style=\"margin: 5px 0;\">In a large bowl, pour in 1 bottle of beer. Sift 1 & 1/2 cups flour into the bowl, whisking in gently until just combined. Stir in 1/2 tablespoon House Seasoning.</li>\n    <li style=\"margin: 5px 0;\">Pat fish dry and season on both sides with salt and pepper. Coat fish in the beer batter, then dredge in 1/2 cup of remaining flour.</li>\n    <li style=\"margin: 5px 0;\">Carefully slide fish into oil making sure each piece has room to fry. Turn over frequently, until deep golden and cooked through, 4 to 5 minutes. Remember, fish will continue to fry once removed.</li>\n    <li style=\"margin: 5px 0;\">Transfer to a paper towel-lined baking sheet and keep warm in oven.</li>\n</ol>\n<h2>Chips</h2>\n<ol style=\"font-size: 20px\" className=\"cookingInstructionsOL\">\n    <li style=\"margin: 5px 0;\">Wash and dry potatoes. Cut into french fry shaped strips, and place into bowl of cold water.</li>\n    <li style=\"margin: 5px 0;\">Let soak for about 30 minutes. Replace water every 10 minutes or so.</li>\n    <li style=\"margin: 5px 0;\">Meanwhile, heat oil to 275째F in a Dutch oven or deep pot.</li>\n    <li style=\"margin: 5px 0;\">Remove strips from the water and dry with a towel.</li>\n    <li style=\"margin: 5px 0;\">Place a portion of strips into oil, making sure each strip has some space. Remove after 2-3 mintues and place on paper towel-lined cooking sheet.</li>\n    <li style=\"margin: 5px 0;\">Put cooking sheet into freezer or fridge for 20-30 minutes.</li>\n    <li style=\"margin: 5px 0;\">Heat oil to 375째F.</li>\n    <li style=\"margin: 5px 0;\">Remove strips from freezer/fridge, and fry in oil again. Pull strips out of oil when golden brown, or after about 3-5 minutes. Place on paper towel-lined cooking sheet.</li>\n    <li style=\"margin: 5px 0;\">Sprinkle with salt, and serve.</li>\n</ol>\n<h2>House Seasoning</h2>\n<ol style=\"font-size: 20px\" className=\"cookingInstructionsOL\">\n    <li style=\"margin: 5px 0;\">Mix 2 tsp salt, 1/2 tsp pepper and 1/2 tsp garlic powder together in small bowl.</li>\n</ol>\n<h2>Peas</h2>\n<ol style=\"font-size: 20px\" className=\"cookingInstructionsOL\">\n    <li style=\"margin: 5px 0;\">Fill coffee mug 2/3 full with frozen peas. Add splash of tap water.</li>\n    <li style=\"margin: 5px 0;\">Microwave on high for 1 minute. Stir peas in mug, then microwave again on high for 1 minute.</li>\n</ol>","frontmatter":{"title":"BBQ Ribs","description":"This post is related to the gatsbyjs","rating":1,"recipeIntroParagraph":"Unfortunately, this recipe was an absolute disaster because of a mistake I made with the House Seasoning. I have modified the instructions from Food Network to make them easier to understand. This recipe would have been fantastic, but I misread the amount of house seasoning to use in the beer batter for the fish. The original recipe calls for 2 & 1/2 cups of House Seasoning, and only 1/2 teaspoon is used in the batter (????). I didn't see that the ingredients list says '1/2 teaspoon House Seasoning', and instead followed the instructions that said 'stir in House Seasoning'... you can probably guess how the fish turned out. Extremely salty. So salty in fact, I decided they were not edible, and I just threw them out. Should I have stopped and realized the amount of salt, pepper and garlic powder I was adding was way too much? Yes. But I didn't, and I was left with a nasty product. Next time I won't make that mistake. The chips, on the other hand, were fantastic. Although the process to make them was somewhat lengthy and messy, they were worth it. I would like to try this meal again in the future and see how it turns out with properly made fish.","sourceLink":"https://www.foodnetwork.com/recipes/paula-deen/beer-battered-fish-and-chips-recipe-2040495","sourceWebsite":"Food Network","image":null}}},"pageContext":{"slug":"/bbq-ribs/"}}